commands_templates/DeleteRecording0.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsdl="http://www.onvif.org/ver10/recording/wsdl">
   <soap:Header/>
   <soap:Body>
      <wsdl:DeleteRecording>
         <!--type: RecordingReference-->
         <wsdl:RecordingToken>?</wsdl:RecordingToken>
      </wsdl:DeleteRecording>
   </soap:Body>
</soap:Envelope>